[
  {
    "Id": "465313",
    "ThreadId": "218895",
    "Html": "<p>Hi there,<br>I'm testing actually new glasses from Vuzix it's model WRAP 920AR to make some Augmented Reality project with  stereoscopic effect, but unfortunately I'm not able to run it in GoblinXNA due to missing  drivers for Windows 7 platform. <br>On Vuzix website noticed that all  softwares are related with an older version of Vuzix iWear VR920 and nothing from this software don't want work.<br> Is there any possibility to make this device working with actual version of Goblin ?? After connecting it to computer WIN7 detected 2 cameras and 2 displays but I can't force it run this with Tutorial 13.<br><br>On last CES 2010 there was  posibility to test this Vuzix Wrap 920AR glasses with simple Marble game  example using GoblinXNA 3.4.&nbsp; So is there any chance ?<br> Link to movie: <a href=\"http://www.youtube.com/watch?v=lpcyMn6UVKY\">http://www.youtube.com/watch?v=lpcyMn6UVKY</a></p>\r\n<p>Thank you in advance for reply.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-07-09T03:42:30.573-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "466185",
    "ThreadId": "218895",
    "Html": "Did you get the latest driver and SDKs from Vuzix? They have sent me new driver and SDKs that would work for Wrap920AR. Without that, I don't think it will work.\r\n\r\nUnfortunately, we're not distributing Marble game.\r\n\r\nOhan",
    "PostedDate": "2010-07-12T01:55:52.11-07:00",
    "UserRole": "Owner",
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "466497",
    "ThreadId": "218895",
    "Html": "<p>Yes i have already installed i think latest version of :</p>\r\n<p>iWearSDK_v3.0.6.exe&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; -&nbsp;&nbsp; 28,6 MB (29&nbsp;995&nbsp;408 bytes)<br>and<br>DRV_UVC_20100202_WHQL.exe&nbsp;&nbsp; - 21,7 MB (22&nbsp;858&nbsp;981 bytes)</p>\r\n<p>I tried modify Tutorial 13 to run only stereoscopic effect on Vuzix WRAP 920AR but unfortunatelly unsuccessfuly :/<br>I replaced all parameters in &quot;IWRProductID&quot; from &quot;IWR_PROD_VR920&quot; to &quot;IWR_PROD_WRAP920&quot; but no success.<br>I realized that WRAP920 is not equal WRAP920AR so that's a problem. And how can i know whch number of id is for WRAP 920AR ?</p>\r\n<p>My problem is also that one camera is only working on this glasses i can't run it both on the same time.</p>\r\n<p>any chance for quick tips or maybe simple tutorial to run this glasses ?</p>",
    "PostedDate": "2010-07-12T13:38:28.083-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "471587",
    "ThreadId": "218895",
    "Html": "ohanoda -&gt; Can you share these drivers which are working for you with WRAP 920AR? \r\nAnd one more question. \r\nWhat product id number is for WRAP920 AR glasses, which number you used to run marble game or maybe where I can check this id?\r\nI know that product Id's are defined in class iWearDllBridge\r\n\r\n\r\npublic enum IWRProductID\r\n\r\n\r\n        {\r\n\r\n            IWR_PROD_NONE = 0,\r\n\r\n            IWR_PROD_VR920 = 227,\r\n\r\n            IWR_PROD_WRAP920 = 329,\r\n\r\n        }\r\n\r\n\r\nWhen i try IWR_PROD_WRAP920 it's still don't want work.\r\nI'm using Windows 7 x64 with Visual Studio 2008 and of course XNA 3.1 and GoblinXNA 3.4. Are you using WINXP or WIN7 ?\r\nThx in advance for reply\r\n\r\n\r\n//edited something is wrong with text formating\r\n\r\n",
    "PostedDate": "2010-07-23T06:09:33.51-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]