[
  {
    "Id": "597852",
    "ThreadId": "254040",
    "Html": "\r\n<p>Hi,</p>\r\n<p>Im working on a goblin project and I have a few questions. I would really appricate any answers provided.</p>\r\n<ol>\r\n<li>I generate a 3D object relative to the marker position and I would like to know the postion of this 3D object.\r\n</li><li>I need to find the position of the guitar marker in a (640,480) image. When I use GuitarMarker. WorldTransformation it returns the world coordinates.\r\n</li></ol>\r\n<p>Thanks :)</p>\r\n",
    "PostedDate": "2011-04-15T04:50:05.887-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "598722",
    "ThreadId": "254040",
    "Html": "<p>Hi,</p>\r\n<p>&nbsp;</p>\r\n<p>1.&nbsp; This depends on how you have set up your scene.&nbsp; If you make it like this:</p>\r\n<p>&nbsp;</p>\r\n<p>Scene.Root-&gt;MarkerNode-&gt;TransformNode-&gt;GeoNode&nbsp; then the 3DModel (the geonode) will have a fixed position (which you define by setting the translation component of the transformNode)</p>\r\n<p>&nbsp;</p>\r\n<p>When working with markers following Tutorial8, the camera is fixed at 0,0,0</p>\r\n<p>&nbsp;</p>\r\n<p>The marker node will have a translation and rotation based on its location relative to the camera</p>\r\n<p>&nbsp;</p>\r\n<p>If you want the 3D object relative to the camera then you need to multiply the translation of the marker node by the translation you have placed between the markernode and the geoNode (The TransformNode in my chain above)</p>\r\n<p>&nbsp;</p>\r\n<p>2.&nbsp; Try reading the Translation property of the GuitarMarker..If you want rotation then read the Rotation propoerty.&nbsp; You can use these to build a transformation object.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2011-04-17T11:11:45.507-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "600510",
    "ThreadId": "254040",
    "Html": "<p>Hi,</p>\r\n<p>Thank you very much for the detailed explanation. Please check this image http://img97.imageshack.us/i/markerdetectioncopy.jpg/</p>\r\n<p>I  manage to retreive finger cordinates using open cv and pass it to XNA.  What I want to do is to see if there is a collision between the finger  cordinates and the object generated by Goblin. Is the physics engine  going to help me.</p>\r\n<p>I would really appriciate if you could give me some guidance on this issue.</p>\r\n<p>Thanks</p>",
    "PostedDate": "2011-04-20T09:48:52.413-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]