[
  {
    "Id": "871876",
    "ThreadId": "372135",
    "Html": "\r\n<p>A question pick from the air... just thinking whether is it possible to use two or more physics engine at a time? lets say we want to use Newton for the joint and Matali for the cloth.</p>\r\n<p>Will it conflict or perhaps our program goes haywire...</p>\r\n",
    "PostedDate": "2012-07-17T19:00:50.34-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "879248",
    "ThreadId": "372135",
    "Html": "<p>It's not supported by default, but theoretically, that's totally possible. You will need to manage the 2nd physics engine by yourself though, and running 2 physics engine at a time will consume a lot resources. By the way, cloth simulation using Matali is quite slow when you have larger number of joints to simulate physically realistic cloth.</p>\r\n<p>Ohan</p>",
    "PostedDate": "2012-07-20T01:51:43.317-07:00",
    "UserRole": "Owner",
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "879312",
    "ThreadId": "372135",
    "Html": "<blockquote style=\"border: solid .1em #ccc; font-style: italic; margin: .25em 1em 0 1em; padding: 0 .25em 0 .25em;\"><strong>ohanoda wrote:</strong><br />\r\n<p>It's not supported by default, but theoretically, that's totally possible. You will need to manage the 2nd physics engine by yourself though, and running 2 physics engine at a time will consume a lot resources. By the way, cloth simulation using Matali is  quite slow when you have larger number of joints to simulate physically realistic cloth.</p>\r\n<p>Ohan</p>\r\n</blockquote>\r\n<p>thanks ohan...i was thinking of implementing separate physics engine with separate classes. But since it does not give good return i'll stick to one.</p>",
    "PostedDate": "2012-07-20T02:16:40.46-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "880728",
    "ThreadId": "372135",
    "Html": "<p>If you really want to do cloth simulation efficiently, you may want to try the commercial version of Havok physics. Their free version don't come with cloth simulation unfortunately.</p>",
    "PostedDate": "2012-07-20T12:06:34.19-07:00",
    "UserRole": "Owner",
    "MarkedAsAnswerDate": null
  }
]