[
  {
    "Id": "163362",
    "ThreadId": "48922",
    "Html": "I want to create a new set of &quot;toolbar&quot; markers.<br>\r\n<br>\r\nIs there any program or function to generate new marker sets for ARTag ? I'm aware of how the ARTag marker library works and the ARTag website says there's a generating function in the SDK rev2k but I've read the included docs and so far haven't found any clues yet. I guess I can copy-paste from the existing ground and toolbars to create new sets but still prefer a function to ease the process.\r\n",
    "PostedDate": "2009-03-01T22:42:40.93-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "163595",
    "ThreadId": "48922",
    "Html": "You can generate new set of markers by providing the ID of the marker you want to generate.<br>\r\n<br>\r\nYou can find the marker creation project under ...\\artag_rev2k_sdk_windows_1209\\Sample_projects\\visual_studio_2005\\artag_create_marker .<br>\r\n<br>\r\nohan\r\n",
    "PostedDate": "2009-03-02T14:19:49.163-08:00",
    "UserRole": "Owner",
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "425238",
    "ThreadId": "48922",
    "Html": "<p>I run artag_create_marker and encountered the error &quot;The application has failed to start because its side-by-side configuration is incorrect. Please see the application event log for more detail.&quot; I have checked the suggestion in Goblin XNA (<a href=\"http://goblinxna.codeplex.com/Thread/View.aspx?ThreadId=48264\">http://goblinxna.codeplex.com/Thread/View.aspx?ThreadId=48264</a>) and downloaded the latest version of ARTag SDK, but error persists. I'm using VS 2008 professional edition. Can anyone please give me a hint how to solve this? Thanks!</p>",
    "PostedDate": "2010-03-29T21:52:55.513-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "425547",
    "ThreadId": "48922",
    "Html": "<p>You're welcome to use ARTag, but since we don't use ARTag anymore (it's still supported in Goblin XNA, but we don't use it for our research anymore), I won't be able to support for ARTag related issues.</p>\r\n<p>Ohan</p>",
    "PostedDate": "2010-03-30T09:01:39.813-07:00",
    "UserRole": "Owner",
    "MarkedAsAnswerDate": null
  }
]