[
  {
    "Id": "185214",
    "ThreadId": "54880",
    "Html": "The followings are the changes for version 3.2 (also noted in the ReleaseNotes.txt that comes with the download)<div><br></div><div><div><br></div><div>1. New Support</div><div><br></div><div>   a) Added Vuzix's iWear VR920 (which is a stereoscopic display with orientation tracking) support, and the </div><div>      classes can be found in GoblinXNA.Device.iWear package.</div><div><br></div><div>   b) Added GetClosestPoint(..) method in NewtonPhysics which calculates the closest points between two</div><div>      physics object.</div><div><br></div><div>   c) Added additional placement options for Notifier class. Now it allows custom starting location and</div><div>      transition direction.</div><div><br></div><div>   d) Added a &quot;tools&quot; folder, and the visual debugging tool (SceneGraphDisplay) is included.</div><div><br></div><div>   e) Added ImageFormat enum in IVideoCapture class that specifies the format of ImagePtr property, which</div><div>      will be passed to the marker tracker library. ImageFormat parameter is added to the InitVideoCapture(...)</div><div>      function. Prior to this change, the format of ImagePtr was always R8G8B8_24 format which works for</div><div>      ARTag.</div><div><br></div><div>   f) Added tutorial 13 for iWear VR920 stereo demo.</div><div><br></div><div>   g) Added LeftEyeVideoID, RightEyeVideoID, LeftEyeVideoImageShift, and RightEyeVideoImageShift properties </div><div>      to Scene class in order to support stereo video overlay.</div><div><br></div><div>   h) Added VideoVisibleArea property to Scene class so that the visible area of the video image rendered on the</div><div>      background can be modified. By default, it rendres the entire video image when ShowCameraImage is set to</div><div>      true.</div><div><br></div><div><br></div><div>2. Modifications</div><div><br></div><div>   a) Removed audioDeviceID parameter from IVideoCapture's InitVideoCapture(...) function since it's unlikely</div><div>      that anyone will use the audio input that comes with the webcam. Also, if you see the discussion post,</div><div>      it puts weird restriction on the resolution of the video device when audio device is used, so it's more</div><div>      harmful than useful to have the audioDeviceID parameter.</div><div><br></div><div>   b) Changed MarkerNode constructors' last parameter's type from &quot;params String[]&quot; to &quot;params Object[]&quot;.</div><div><br></div><div>   c) GenericInput, KeyboardInput, MouseInput, GPS, InterSense, and InputMapper classes are now singleton </div><div>      classes, so you should use the Instance property to access their instantiations. </div><div><br></div><div>   d) GPS and InterSense classes are not automatically initialized by the InputMapper class anymore, so you</div><div>      need to create their instance and initialize them yourself, and add them to InputMapper class through </div><div>      InputMapper.AddInputDevice(...) or InputMapper.Add6DOFInputDevice(...) functions if you want to use either </div><div>      InterSense or GPS device. After you add them, make sure to call InputMapper.Reenumerate() function. </div><div><br></div><div>   e) Due to the change above, you don't need the InterSenseEnable, InterSenseHost, or InterSensePort setting</div><div>      variables in the setting file to use InterSense anymore. Instead, you should directly pass those parameters</div><div>      (host name and port number) to InterSense constructor if you want to connect to it through network server.</div><div><br></div><div>   f) Removed InputDeviceDriver class since it's not used anymore.</div><div><br></div><div>   g) Modified several tutorials due to the changes above.</div><div><br></div><div>   h) Modified the ground marker array for tutorial 8.</div><div><br></div><div>   i) IMarkerTracker interface now requires ZNearPlane and ZFarPlane property.</div><div><br></div><div><br></div><div>3. Improvements &amp; Bug Fixes</div><div><br></div><div>   a) Fixed tutorial 11 problem, and tutorial 8 problem (incorrect ground size).</div><div><br></div><div>   b) Fixed undeterministic behavior when adding nodes. If a node is added to the scene graph while the scene</div><div>      graph is being traversed, it can cause undeterministic behavior. This problem has been fixed.</div><div><br></div><div>   c) Fixed re-addition of Newton joints when RestartSimulation() is called in NewtonPhysics. </div></div>",
    "PostedDate": "2009-04-29T14:07:33.453-07:00",
    "UserRole": "Owner",
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "185648",
    "ThreadId": "54880",
    "Html": "Hi Ohan,<br>\r\njust downloaded the version 3.2 to update my project, but it needs NyArtoolkit.. Is it necessary? I went through the installation guide and it isn't there. Which version should be downloaded?<br>\r\n<br>\r\nThanks,<br>\r\n<br>\r\nLaetitia Mendes<br>\r\n",
    "PostedDate": "2009-04-30T10:57:32.197-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "185682",
    "ThreadId": "54880",
    "Html": "Oops, please remove the reference from Goblin XNA project. It should not be there. Thanks for letting me know. I'll make that change.<br>\r\n<br>\r\nOhan\r\n",
    "PostedDate": "2009-04-30T12:24:39.343-07:00",
    "UserRole": "Owner",
    "MarkedAsAnswerDate": null
  }
]