[
  {
    "Id": "283793",
    "ThreadId": "82563",
    "Html": "<p>Hi there,</p>\r\n<p>While not a Goblin XNA&nbsp;specific&nbsp;question, I hope it is okay to ask here nonetheless.</p>\r\n<p>I'm trying to use ALVAR with Goblin XNA, but as per the Tutorial 8 example, need a calib.xml file to be able to do so.&nbsp;My understanding&nbsp;is that this file is generated by the &quot;SampleCamCalib&quot; demo that comes with ALVAR. Problem is, I can't compile the code from the samples.</p>\r\n<p>I get an error for a missing dll (alvar120.dll) even though it's referenced into the project. I've been working on this with a teammate for a couple days and we're pulling our hair out. We may have overlooked something, but in our somewhat limited programming experience can't see it.</p>\r\n<p>Does anyone know if there is a pre-compiled version of the camera calibrator, or any easier way of going about this?<br>The help would be greatly appreciated.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-30T16:33:24.167-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "283796",
    "ThreadId": "82563",
    "Html": "<p>EDIT:</p>\r\n<p>Well, we fixed the issue. As it happens the required DLL's had to be in the same directory as the executables.</p>\r\n<p>Pardon the spam.&nbsp;</p>",
    "PostedDate": "2010-01-30T17:04:48.407-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "419115",
    "ThreadId": "82563",
    "Html": "<p>I'm sorry to say all these various libraries are rather new to me. However, I have followed all the stages in the wiki to get GoblinXNA installed and hit a wall as the samplecamconfig executable is crashing just after the two initial setup screens. Am using an XBox 360 LIVE vision web camera, but the calibration sample fails just after the video window is rendered. I have the GLUT, Alvar etc dlls in the same folder but no joy in getting the calibration to work. There are several mentions of a Tutorial 8 but cannot find this anywhere on the site. I am doing this, because some of my undergraduate students want to work with this library. I think they would prefer ARTag to ALVAR, but don't seem to be able to find the ARTag wrapper dll&nbsp; that is mentioned in your wiki documentation. Any ideas?</p>",
    "PostedDate": "2010-03-17T02:55:35.247-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "419313",
    "ThreadId": "82563",
    "Html": "<p>If you're having problem with compiling ALVAR sample projects, please contact VTT directly since I won't be able to fix them.</p>\r\n<p>For ARTagWrapper.dll, it should come with ARTag distribution.</p>\r\n<p>Ohan</p>",
    "PostedDate": "2010-03-17T10:08:41.94-07:00",
    "UserRole": "Owner",
    "MarkedAsAnswerDate": null
  }
]